__file__ = 'cza'


"""别人简历上写的技能
以下是我会的技能

完整的 Web 项目开发以及部署经验，理解软件工程开发架构
熟练在 Debian-Like 下使用 Python 进行开发以及部署
熟练掌握 Python，掌握 socket 核心模块，了解多进程与多线程
熟练使用 Git，具有良好编程习惯，了解 SVN
会使用 Django/Flask 框架，会使用 MySQL 数据库，了解 MongoDB 文档数据库
会使用 Nginx+uwsgi+supervisor 上线部署 Python 相关项目
优秀的英语读写能力，给开源项目提交过代码
了解 RESTful API，Docker，HTML/CSS，JavaScript，HTTP 协议

"""

"""网友评论
一般在简历中把 git svn 相关的东西写上去的一般都是新手

1. 尽量填满纸张，避免大面积空白（第二页那一行删掉）。
2. ‎ Github 有能拿出手的项目也最好说一下（ show code ）。
3. ‎项目经历也要说下效果（执行效率啊，资源占用啊，用户体验之类），PhotoShop 最好不要提。。毕竟是找后端岗位。
4. ‎也可以借鉴下模板，比如项目名称加粗等优化阅读体验的细节。
5. ‎后面提到英语读写能力，最好把翻译的文档也拿一篇出来，更有说服力（其他也同理，面试官可能会让你举个栗子证明自学能力，要提前想好）。
P.S. 握爪，在下去年的求职贴帖也只有 2 回复。。

首先我一般改简历都是需要收费的但是对于 v 友就免费吧
1.抛去简历你的工作经历时间短作为，就说明你的这些工作经验没什么难度可言？
2.简历里面应该有数据结构算法
3.SVN 和 git 像你这种一年工作经验的就不要写了应为天天用都快用烂了，而且你写了解，会让人觉得你很 low
4.看完简历感觉你是在找运维的工作，你很会部署我不知道部署有多困难
5.现在开发 Pythonweb h5 和 css3 和 JS 难道你都不敢写熟悉吗，除了这些我觉得你还需要学一些前段框架 Vue，或者 rect 这些最简单的东西我个人建议改成熟悉也应该熟悉
6，一年工作经验应该了解很多，楼主这样成长速度太慢，而且一年换两份工作我不知道楼主职业规划如何规划的这里不好发言

希望楼主的 Python 基础继续扎实下，线程应该熟悉的，做好自己的职业规划，
也希望楼主能找份好工作，扩充展开的可以从爬虫等展开想干 web 的话了解简单的前段框架很有必要
"""

"""面试经验
三面非常重要，因为前两面可能是你未来入职的同事，不会问的很深。

但是对于三面的面试官来讲，你需要对简历上的每一个公司或者项目有一套非常成熟的措辞，
如果想拿到 15k 往上的 offer，三言两语就说完项目这块内容，基本凉凉。你需要通过项目的描述，
让他能感受到你解决问题的能力、学习的能力、工作的态度等等。

关于性格，企业都愿意招沟通能力强的人，说白了就是要健谈，
每个面试官都不希望和应聘者玩“你问我答”的游戏，一定要主动沟通，主动的去介绍自己、推销自己。
"""


"""别人的简历
个人基本信息

姓    名： ***                              性    别： 男                    

年    龄： 25岁                               籍    贯： 湖北

居 住 地： 深圳                           工作年限： 3年               

手    机： 176********                       E-mail :   ********@gmail.com

求职意向

目标职位：java开发工程师                        工作性质：全职

目标地点： 深圳                                 期望薪资：面议

教育背景

学校：武汉*******                 专业：计算机技术应用                         学历：专科

开发技能描述

具备扎实的Java基础，深入理解面向对象，具有良好的编码习惯
熟练使用Elipse，IDEA，Maven，SVN，Git等开发工具
3. 熟练掌握Struts2、Hibernate、Spring、SpringMVC、SpringBoot、springCloud、MyBatis等主流框架
4. 熟悉VUE，nodeJs，js，Ajax，jq等前台开发技术
5. 熟悉Oracle、MySQL关系型数据库，redis、mongoDb非关系型数据库
6. 熟悉Linux常用命令以及服务配置
7. 其他技术：Eureka、Feign、jenkins、kindEditor、kafka、elasticSearch、Shiro、webService、MyBatis Plus、Quartz 、echarts、POI等
工作经验    

2016年10月到2018年5月              广东***科技控股有限公司             java开发工程师

2018年5月到 2019年12月               广州**信息科技有限公司              java开发工程师

项目经验

项目一： ***erp系统（2016.10-2018.5） http://erp.*****.com.cn

项目描述：

本项目是公司自主开发的一套企业管理的erp系统，项目上线，所有员工均可使用。主要目的是为了实现仓库物料，员工业绩，员工办公，财务账目，仪器设备，公司文档等方面的规范化管理以及提高工作效率。

项目架构：spring+springMVC+hibernate+shiro+mysql

 

责任描述：

1、负责办公模块的工作呈报，行程管理等和市场模块的汇报管理，退货管理，货物交接，货物申请等功能的开发，后期二次开发功能完善；

2、线下反馈问题的及时解决；

3、部分BUG的测试和修改;

4、参与项目需求的讨论与分析

项目二： 湖南省********教育网 (2018.5—2019.11)   http://www.*****.com

项目描述：

该项目是一个面向社会人群的教育培训网站，实现用户购买课程，学习课程，完成考试，出具证书等业务。前台方面有登录，购物车，订单，证书，学习，考试等模块。后台方面有，数据统计，财务管理，课件管理，证书管理，考试管理，用户管理等模块。

项目架构：spring+springMVC+mybatis+shiro+memcached+oracle

责任描述：

1、完成后台订单统计，学习统计，证书统计等数据统计模块

2、完成考试相关功能开发，试题，试卷，考试成绩管理等

3、完成发票功能开发，用户开具发票，后台审核开具发票

4、完成证书模块开发，用户出具、合并证书，后台管理证书模板

5、使用echarts进行统计数据可视化

6、项目需求分析讨论、bug修复

项目三： **健康  (2018.5—2019.11)  http://**.******.com

项目描述： 

本项目主要采用与各大医疗机构合作的方式，实现了医生与患者之间无缝对接。医生培训提升，患者康复咨询两不误。后端主要模块有授权服务，用户服务，课程服务，订单服务，文章服务，广告服务，积分服务，考试服务，学历服务，上传服务，证书服务，微信服务，数字大赛服务，协会服务、菜单服务等十几个服务组成。

项目架构：springCloud（euraka+getway+config+feign）+mongodb+redis+mysql+kafka

责任描述：

1、负责文章服务、广告服务设计与开发，实现文章、广告新增发布修改审核等功能，并使用mogodb存入文 章数据解决文章加载过慢的问题。

2、负责菜单服务的设计与开发，实现前端页面数据模块化

3、负责考试服务设计与开发，实现组题，组卷，考试等功能，并使用kafka解决服务调用用户新增考试安排出 现的分布式事务问题。

4、负责微信服务的设计与开发，实现微信公众号素材管理，菜单管理，群发消息管理等功能

5、负责数字大赛服务设计与开发，实现用户报名参赛，上传作品，导师投票，群众投票，分数统计等功能

6、协会服务设计与开发、积分服务设计与开发

7、项目需求分析，技术选型

自我评价

工作自觉、为人友善、性格开朗、团结同事、学习能力强、抗压能力好、沟通能力强，能承受一定的工作压力。
"""

"""
2020 应届生，有两年的互联网工作经验，以技术负责人身份带领10-20 人的技术团队进行电商、点餐、支付类系统开发。
本人的主要职责是负责核心系统核心模块的设计、开发、以及整体技术管理，从 0 到 1，从 1 到总结，整个闭环流程。

###科技有限公司(2017.9 ‒ 至今)
项目开发，负责框架与组件的选配及设计、模块的业务职责划分，核心模块的数据库设计把控、线上杂难问题定位。
技术管理，负责团队技术人员招聘与管理、开发流程规划及制定，以及开发基础设施建设，包括分支管理模式、持续集成方案、通用权限系统设计开发、代码分层设计。
项目管理，负责利用Tower进行技术排期-研发-测试-验收-持续迭代的闭环管理，与研发、设计、产品、运营各部门沟通，推动产品、需求优化落地。
项目经历
###点餐系统 (2019.02 ‒ 至今)
本系统为校园外卖提供线上运营的解决方案，可提供多所学校和饭堂的入驻，同时包含一元券、秒杀、抽奖等营销功能。总体分为点餐、学生跑腿、营销三大板块。目前日均交易流水达 10W+，已入驻 8 所学校，几十余个饭堂。

主要负责线上服务器高负载排查、性能优化（ webserver 优化，缓存优化，Mysql 优化），保证高峰时段的可用性保障与整体性能

利用htop pidstat perf等命令进行高峰期**CPU100%**负载分析，排查定位并分析具体问题。
优化nginx+php-fpm配置，最大化利用核心与内存资源，热点接口用 swoole 的协程 API 重写
针对慢 SQL 日志，集合 Explain 语句，优化联合索引编排，强制指定索引；排查长事务，进行小事务拆分；分析 Gap Lock、死锁等INNODB 锁问题。
xxxxx 支付系统——支付服务 SaaS 化 (2017.9 ‒ 至今)
本系统主要为各软件系统提供支付解决方案，聚合了多个三方支付通道，提供交易、分账、资金清算管理后台，同时具备代理机制作为推广手段。 
目前约有 15 个活跃商户，日交易流水约15W+。

定义了通用的第三方 RPC 调用流程，统一订单类调用状态流转，并使用了RocketMQ（事务回查）来作为主要的状态保存机制，而非直接入库。
利用了A/B部署方案，实现不停机更新，可回滚的部署机制
利用面向对象设计了服务层、渠道适配层、渠道 RPC 层的架构来处理上游接口的异构性问题

技能清单
开发语言：Java/PHP
Sql/NoSql：MySQL/Redis/MongoDB
后端框架: Spring/SpringBoot
中间件: RocketMQ
容器云：docker/kubernetes
前端框架：Layui/Vue/Flutter
版本管理：Git
CI：Jenkins/Drone
项目管理：Tower

自我评价
具备创业精神、极客精神，逻辑思维缜密，对技术充满热情，热衷探究对各类技术框架、中间件设计模式、原理。
擅长对软件系统进行宏观的复杂度分析，制定架构方案，能够科学地分析问题。
拥有极强的快速学习应用能力，知识体系构建能力、出色的沟通协作能力，良好的产品意识、以及一定的项目管理能力。

校园经历
担任广东工业大学 2015 届辩论队队长
担任广东工业大学材料与能源学院 2015 届队长及教练
担任学校创新创业孵化基地工作室核心成员
第四届“泰迪杯”全国大学生数学挖掘竞赛 B 题(高铁客流量)二等奖
2017 年美国大学生数学建模竞赛 B 题二等奖
2018 年美国大学生数学建模竞赛 C 题三等奖 
"""

"""https://cba.github.io/resume/
网友建议：
1、可以加一些项目优化方面的内容，多一些数字形式的表达，例如“经过 xxx 优化后，接口响应速度提高 xx%”
2、工作内容建议放到技能后面，技能是最基础、重要的。
3、个人建议。
    微信不要留
    薪资 9 － 11K 应该修正：比如 希望薪资或是离职前薪资就写 11K。不建议写 9 － 11K。因为你工作不到一年。
    增加一条：你的工作态度描述 很重要。因为很少人会加这一条。我在做 HR 时。我特别留意这一条。
4、
    期望薪资别写出来，显得你太被动；
    项目经验写的太粗略了，比如“数据库设计及开发”、“主力接口开发”这些词汇，emmmm （我不清楚你们后端开发是不是都这么写的，我是写出技术点的）
    技能清单那一块我觉得可以精简一些
resume
李启爱的简历(在职)
联系方式
手机：176-xxxx-5010
Email：liqiai@live.com
期望
期望职位：PHP软件工程师/Golang软件工程师
期望薪资：税后月薪9~11k
期望城市：昆明
个人信息
李启爱/男/1994
专科/江苏联合职业教育学院 - 安全工程学院 工程测量专业
本科在读/云南大学 - 职业与继续教育学院 计算机科学与技术专业
工作年限：4年
自我评价：不错的的学习与接受能力，有一定的承压能力，对新技术保持有一定的好奇心与热情，有意深入golang web 微服务方向开发
技术博客：https://blog.cnbattle.com
Github：https://github.com/cnbattle
工作经历
New company New job.
五八零科技股份有限公司（2018年4月~至今）
职位
后端主程/运维
职责
基于laravel/Lumen后端开发 (60%)
Golang开发 (20%)
Linux服务器运维 (10%)
提供技术难点可执行方案 (10%)
项目
抖圈 & 本地短视频 & 同城知了
基于Lumen5.5
独立数据库设计及开发，服务端的视频处理，音频处理，性能调优
主力接口开发
店老板
基于Laravel5.5
数据库设计及开发
接口开发
其他
微信公众号图文爬虫系统（Golang、nodejs）、腾讯视频爬虫系统（Golang）、抖音爬虫系统（Golang、nodejs）

云南翡翠王朝文化传播有限公司（2017年7月~2018年4月）
职位
PHP后端开发
职责
php开发
客户子系统
基于Laravel5.5
负责数据库设计及开发，包括用户相关的资料、积分、评论、地址和通宝商城的客户端及管理端API开发
分销商系统
基于ThinkPHP5.1
负责数据库设计及管理后台开发、API开发、实现用户追踪、订单交易绑定、收益结算等功能
客户子系统客户端API整合
基于ThinkPHP5.0
实现一个api网关，实现header、body参数验证、数据缓存、数据处理等的统一管理
其他
翡翠王朝PC站新版导航（ThinkPHP3.2）、APP直播后台相关开发（ThinkPHP5.0、阿里云）、内部管理系统开发

上海错觉文化传播有限公司（2014年7月~2017年6月）
职位
PHP全栈开发+Linux运维
职责
php全栈 (90%)
Linux运维 (10%)
微信第三方开发
负责公司公众号相关功能开发，微信H5开发，微信投票程序开发

其他全栈开发
上海错觉文化传播有限公司官网项目、南京葫芦兄弟网络科技有限公司官网项目、春城助手小程序项目、春城社区wap网站项目

开源项目
douyin ：抖音视频爬虫方案，300+ star
drone-gitea：drone+gitea的CI CD方案
wubi：golang 汉字转五笔包（86版五笔编码）
PHPBase：在维护和自用php常用函数集合composer包
AIIO：在维护和自用golang相关扩展包集合
wechat-JS-SDK-SAE：微信js sdk SAE版
技能清单
开发语言：PHP Golang
框架：
PHP：Laravel Lumen ThinkPHP CodeIgniter
Golang：Gin Gorm Go-micro
数据库缓存相关：MySQL SQLite Redis MemCache
云和开放平台：熟悉阿里云/腾讯云/七牛等云平台SDK、熟悉微信生态H5/小程序相关开发
操作系统：熟悉Debian系Linux，了解Centos、了解Linux一般运维工作、了解分布式系统
目前工作环境：
OS：Linux Mint
IDE：PHPstorm Goland
开发环境：Docker Vagrant
版本管理及其他工具：Git Composer
技能储备(学习中)
Shell
Systemd
致谢
感谢您花时间阅读我的简历，期待能有机会和您共事。
"""