__file__ = 'cza'


"""别人简历上写的技能
以下是我会的技能

完整的 Web 项目开发以及部署经验，理解软件工程开发架构
熟练在 Debian-Like 下使用 Python 进行开发以及部署
熟练掌握 Python，掌握 socket 核心模块，了解多进程与多线程
熟练使用 Git，具有良好编程习惯，了解 SVN
会使用 Django/Flask 框架，会使用 MySQL 数据库，了解 MongoDB 文档数据库
会使用 Nginx+uwsgi+supervisor 上线部署 Python 相关项目
优秀的英语读写能力，给开源项目提交过代码
了解 RESTful API，Docker，HTML/CSS，JavaScript，HTTP 协议

"""

"""网友评论
一般在简历中把 git svn 相关的东西写上去的一般都是新手

1. 尽量填满纸张，避免大面积空白（第二页那一行删掉）。
2. ‎ Github 有能拿出手的项目也最好说一下（ show code ）。
3. ‎项目经历也要说下效果（执行效率啊，资源占用啊，用户体验之类），PhotoShop 最好不要提。。毕竟是找后端岗位。
4. ‎也可以借鉴下模板，比如项目名称加粗等优化阅读体验的细节。
5. ‎后面提到英语读写能力，最好把翻译的文档也拿一篇出来，更有说服力（其他也同理，面试官可能会让你举个栗子证明自学能力，要提前想好）。
P.S. 握爪，在下去年的求职贴帖也只有 2 回复。。

首先我一般改简历都是需要收费的但是对于 v 友就免费吧
1.抛去简历你的工作经历时间短作为，就说明你的这些工作经验没什么难度可言？
2.简历里面应该有数据结构算法
3.SVN 和 git 像你这种一年工作经验的就不要写了应为天天用都快用烂了，而且你写了解，会让人觉得你很 low
4.看完简历感觉你是在找运维的工作，你很会部署我不知道部署有多困难
5.现在开发 Pythonweb h5 和 css3 和 JS 难道你都不敢写熟悉吗，除了这些我觉得你还需要学一些前段框架 Vue，或者 rect 这些最简单的东西我个人建议改成熟悉也应该熟悉
6，一年工作经验应该了解很多，楼主这样成长速度太慢，而且一年换两份工作我不知道楼主职业规划如何规划的这里不好发言

希望楼主的 Python 基础继续扎实下，线程应该熟悉的，做好自己的职业规划，
也希望楼主能找份好工作，扩充展开的可以从爬虫等展开想干 web 的话了解简单的前段框架很有必要
"""

"""面试经验
三面非常重要，因为前两面可能是你未来入职的同事，不会问的很深。

但是对于三面的面试官来讲，你需要对简历上的每一个公司或者项目有一套非常成熟的措辞，
如果想拿到 15k 往上的 offer，三言两语就说完项目这块内容，基本凉凉。你需要通过项目的描述，
让他能感受到你解决问题的能力、学习的能力、工作的态度等等。

关于性格，企业都愿意招沟通能力强的人，说白了就是要健谈，
每个面试官都不希望和应聘者玩“你问我答”的游戏，一定要主动沟通，主动的去介绍自己、推销自己。
"""


"""别人的简历
个人基本信息

姓    名： ***                              性    别： 男                    

年    龄： 25岁                               籍    贯： 湖北

居 住 地： 深圳                           工作年限： 3年               

手    机： 176********                       E-mail :   ********@gmail.com

求职意向

目标职位：java开发工程师                        工作性质：全职

目标地点： 深圳                                 期望薪资：面议

教育背景

学校：武汉*******                 专业：计算机技术应用                         学历：专科

开发技能描述

具备扎实的Java基础，深入理解面向对象，具有良好的编码习惯
熟练使用Elipse，IDEA，Maven，SVN，Git等开发工具
3. 熟练掌握Struts2、Hibernate、Spring、SpringMVC、SpringBoot、springCloud、MyBatis等主流框架
4. 熟悉VUE，nodeJs，js，Ajax，jq等前台开发技术
5. 熟悉Oracle、MySQL关系型数据库，redis、mongoDb非关系型数据库
6. 熟悉Linux常用命令以及服务配置
7. 其他技术：Eureka、Feign、jenkins、kindEditor、kafka、elasticSearch、Shiro、webService、MyBatis Plus、Quartz 、echarts、POI等
工作经验    

2016年10月到2018年5月              广东***科技控股有限公司             java开发工程师

2018年5月到 2019年12月               广州**信息科技有限公司              java开发工程师

项目经验

项目一： ***erp系统（2016.10-2018.5） http://erp.*****.com.cn

项目描述：

本项目是公司自主开发的一套企业管理的erp系统，项目上线，所有员工均可使用。主要目的是为了实现仓库物料，员工业绩，员工办公，财务账目，仪器设备，公司文档等方面的规范化管理以及提高工作效率。

项目架构：spring+springMVC+hibernate+shiro+mysql

 

责任描述：

1、负责办公模块的工作呈报，行程管理等和市场模块的汇报管理，退货管理，货物交接，货物申请等功能的开发，后期二次开发功能完善；

2、线下反馈问题的及时解决；

3、部分BUG的测试和修改;

4、参与项目需求的讨论与分析

项目二： 湖南省********教育网 (2018.5—2019.11)   http://www.*****.com

项目描述：

该项目是一个面向社会人群的教育培训网站，实现用户购买课程，学习课程，完成考试，出具证书等业务。前台方面有登录，购物车，订单，证书，学习，考试等模块。后台方面有，数据统计，财务管理，课件管理，证书管理，考试管理，用户管理等模块。

项目架构：spring+springMVC+mybatis+shiro+memcached+oracle

责任描述：

1、完成后台订单统计，学习统计，证书统计等数据统计模块

2、完成考试相关功能开发，试题，试卷，考试成绩管理等

3、完成发票功能开发，用户开具发票，后台审核开具发票

4、完成证书模块开发，用户出具、合并证书，后台管理证书模板

5、使用echarts进行统计数据可视化

6、项目需求分析讨论、bug修复

项目三： **健康  (2018.5—2019.11)  http://**.******.com

项目描述： 

本项目主要采用与各大医疗机构合作的方式，实现了医生与患者之间无缝对接。医生培训提升，患者康复咨询两不误。后端主要模块有授权服务，用户服务，课程服务，订单服务，文章服务，广告服务，积分服务，考试服务，学历服务，上传服务，证书服务，微信服务，数字大赛服务，协会服务、菜单服务等十几个服务组成。

项目架构：springCloud（euraka+getway+config+feign）+mongodb+redis+mysql+kafka

责任描述：

1、负责文章服务、广告服务设计与开发，实现文章、广告新增发布修改审核等功能，并使用mogodb存入文 章数据解决文章加载过慢的问题。

2、负责菜单服务的设计与开发，实现前端页面数据模块化

3、负责考试服务设计与开发，实现组题，组卷，考试等功能，并使用kafka解决服务调用用户新增考试安排出 现的分布式事务问题。

4、负责微信服务的设计与开发，实现微信公众号素材管理，菜单管理，群发消息管理等功能

5、负责数字大赛服务设计与开发，实现用户报名参赛，上传作品，导师投票，群众投票，分数统计等功能

6、协会服务设计与开发、积分服务设计与开发

7、项目需求分析，技术选型

自我评价

工作自觉、为人友善、性格开朗、团结同事、学习能力强、抗压能力好、沟通能力强，能承受一定的工作压力。
"""